import React from "react";

export default function ProductIntroduction() {
  return (
    <div className="space-y-5">
      <h2 className="text-2xl pb-3 font-black text-zinc-800 relative before:absolute before:bottom-0 before:right-0 before:h-1 before:w-22 before:bg-secondary-500 before:rounded dark:text-white">
        معرفی محصول
      </h2>
      <p className="text-neutral-700 leading-9 text-justify text-lg dark:text-white">
        گر به دنبال تهیه یک هدفون بی‌سیم گیمینگ هستید، هدفون بلوتوثی مدل K55
        به‌عنوان یکی از جدیدترین گزینه‌های موجود در بازار ارزش بررسی را دارد.
        این مدل با ابعادی کوچک تولید شده است. ابعاد و وزن کم آن، جابه‌جایی این
        وسیله و استفاده طولانی‌مدت از آن را آسان می‌کند و باعث خستگی گوش‌ها
        نخواهد شد. این مدل برای اتصال به دستگاه‌ به بلوتوث نسخه 5.0 مجهز شده است
        و در مدت زمان اندکی، اتصال با گوشی موبایل اندروید یا ios شما برقرار
        خواهد شد. هدفون بی سیم K55 دارای یک میکروفون با کیفیت است و و این ویژگی،
        آن را برای مکالمه مناسب می‌سازد. از ویژگی‌های اصلی این محصول محفظه
        نگهدارنده یا همان کیس آن است. این کیس قابلیت شارژ هدفون را دارد. برای
        شارژ آن کافی است از درگاه USB-C تعبیه شده بر روی کیس و کابل شارژ درون
        بسته‌بندی استفاده کنید. گفتنی است باتری 400 میلی‌آمپر ساعتی این هدفون در
        حدود 4-6 ساعت مکالمه و 4-6 ساعت پخش موسیقی را پاسخ‌گو خواهد بود.
      </p>
    </div>
  );
}
