import React from "react";

export default function DescriptionCategory() {
  return (
    <div className="hidden p-5 mt-5 bg-white dark:bg-custom-dark dark:border-gray-700 dark:text-gray-200 rounded-xl tab-content border border-gray-300 drop-shadow">
      <div className="space-y-5">
        <h2 className="text-lg pb-3 font-black text-zinc-800 relative before:absolute before:bottom-0 before:start-0 before:h-1 before:w-22 before:bg-primary-500 before:rounded dark:text-white">
          دسته بندی گوشی موبایل
        </h2>
        <div className="text-neutral-700 leading-9 text-justify text-base dark:text-white">
          به عنوان گوشی‌ای که قیمت خیلی زیادی ندارد، باید به این موضوع اشاره
          کنیم که داخل بسته بندی Redmi 9A آیتم‌های خاصی دیده نمی شود. دفترچه
          راهنما، ابزار خارج کردن سیم کارت و شارژ ۱۰ واتی را به همراه کابل USB
          مشاهده می‌کنید. این گوشی شیائومی در ابعاد ۱۶۴.۹ در ۷۷.۱ در ۹ میلی متر
          ساخته شده و وزن آن هم ۱۹۶ گرم است. در حال کلی باید به این موضوع اشاره
          کنیم که این گوشی خیلی خوب در دست قرار میگیرد. قاب این گوشی بافت جالب
          توجهی دارد و به همین دلیل خیلی خوب داخل دست قرار میگیرد. البته باید به
          این موضوع اشاره کنیم که قاب پشتی گوشی خیلی زود اثر انگشت را به خود جلب
          می‌کند. قاب پشتی که به صورت مات طراحی شده میزبان دوربین‌های پشت است و
          به جز دوربین‌ها چیزی روی آن قرار نگرفته است. به همین دلیل گوشی بسیار
          ساده به نظر می‌رسد. زمانی که به گوشی نگاه می‌کنید، متوجه می‌شوید که
          صفحه نمایش آن حاشیه‌های بسبتا بزرگی دارد.
          <div
            id="extra-text"
            className="text-neutral-700 leading-9 text-justify text-lg dark:text-white"
            style={{ display: "none" }}
          >
            اگر به دنبال تهیه یک هدفون بی‌سیم گیمینگ هستید، هدفون بلوتوثی مدل
            K55 به‌عنوان یکی از جدیدترین گزینه‌های موجود در بازار ارزش بررسی را
            دارد. این مدل با ابعادی کوچک تولید شده است. ابعاد و وزن کم آن،
            جابه‌جایی این وسیله و استفاده طولانی‌مدت از آن را آسان می‌کند و باعث
            خستگی گوش‌ها نخواهد شد. این مدل برای اتصال به دستگاه‌ به بلوتوث نسخه
            5.0 مجهز شده است و در مدت زمان اندکی، اتصال با گوشی موبایل اندروید
            یا ios شما برقرار خواهد شد. هدفون بی سیم K55 دارای یک میکروفون با
            کیفیت است و و این ویژگی، آن را برای مکالمه مناسب می‌سازد. از
            ویژگی‌های اصلی این محصول محفظه نگهدارنده یا همان کیس آن است. این کیس
            قابلیت شارژ هدفون را دارد. برای شارژ آن کافی است از درگاه USB-C
            تعبیه شده بر روی کیس و کابل شارژ درون بسته‌بندی استفاده کنید. گفتنی
            است باتری 400 میلی‌آمپر ساعتی این هدفون در حدود 4-6 ساعت مکالمه و
            4-6 ساعت پخش موسیقی را پاسخ‌گو خواهد بود.
          </div>
          <button
            id="toggle-btn"
            className="mt-2 bg-gray-700 block dark:bg-gray-200 dark:text-gray-900 text-white text-sm px-4 py-2 rounded-lg"
          >
            ادامه مطلب
          </button>
        </div>
      </div>
    </div>
  );
}
